# 1.0 Project overview

## FINACIAL INCLUSIVITY CHECKER

This is the notebook that will house the dataset to be prepared and later analysed in accordance to the project goals.

###DATASET
The group Brainy Badgers, has been tasked with assessing the level of financial inclusion in the region encompassing Kenya, Rwanda , Uganda and Tanzania. This is being done with the help of a dataset called the Financial Inclusion dataset.It is an excel format datatable that has thirteen columns and twenty three thousand five hundred and twenty five rows.The attributes are as follows:

-country -(Country interviewee is in.)

-year -(Year survey was done in.)

-unique id - (Unique identifier for each interviewee)

-location type -(Type of location: Rural, Urban)

-cellphone access -(If interviewee has access to a cellphone: Yes, No)

-household size -(Number of people living in one house)

-Age of respondent -(The age of the interviewee)

-gender of respondent - (Gender of interviewee: Male, Female)

-relationship with head - (The interviewees' relationship with the head of the house:Head of Household, Spouse, Child, Parent, Other relative, Other non-relatives, Dont know)

-maritial status - (The martial status of the interviewee: Married/Living together, Divorced/Seperated, Widowed, Single/Never Married, Don't know)

-education level - (Highest level of education: No formal education, Primary education, Secondary education, Vocational/Specialised training, Tertiary education, Other/Dont know/RTA)

-job type - (Type of job interviewee has: Farming and Fishing, Self employed, Formally employed Government, Formally employed Private, Informally employed, Remittance Dependent, Government Dependent, Other Income, No Income, Dont Know/Refuse to answer)

Prior to the analysis of the dataset, cleaning will be undertaken. Primarily this will involve the removal of duplicates ,removal of the uniqueid column and the changing of the datatypes respectively.

The next step will be the creation of new columns from the breaking of existing columns. From the relationship with head column,we will create a new column called head_of_household,this will state yes if the respondent is the head of the household.

The next column to be broken will be the maritial status column creating a new column called the living_condition which will identify the state of the respondent whether they live with their spouse or not.

To then ensure the validity of the data we will then identify duplications in the dataset ,removing all duplicates from the data.

After these processes the data will be clean to a satisfactory degree and will now be ready for analysis which will be done in this notebook in the sql method

## 1.02 Analysis objectives



This analysis is in the form of answering the objectives:

1.To determine the number of people with access to bank accounts and how this varies in urban and rural areas, between the job type

2.To determine the country with the most mobile phones and the highest number of bank accounts.

3.To determine the people to be targeted with mobile banking intergration

4.To determine the job type to be targeted with fintech marketing in the region for people with a phone but no bank account.

5.To determine the influence of mobile phone access and location to job type

6.To determine which age has the most access to mobile phones.

7.Age with mobile phone but no bank account.

8.Determine which age has the highest access to mobile phones and bank accounts.

9.To determine the percentage of level of access to mobile phones for people in the region per country

10.To determine the percentage of level of access to mobile phones for people in the region

11.To determine the percentage of level of access to mobile phones for people in urban areas and rural areas.

# Loading our Database

In [ ]:
# We will first load the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed. 
%sql sqlite://

'Connected: @None'

# 1.0 Import the libraries

In [ ]:
# Importing the pandas library
# We will use a function read_csv from pandas to read our datasets as shown
#
import pandas as pd

# Upload the table from the csv.

In [ ]:
# Loading our table from the respective CSV files
# We will export the dataset that we have cleaned using python
#
with open('Financial_Inclusivity.csv','r') as f:
    Financial = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Financial;
%sql PERSIST Financial;
%sql SELECT * FROM Financial LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, 'Kenya', 2018, 'Yes', 'Rural', 'Yes', 3, 24, 'Female', 'Spouse', 'Married', 'Secondary education', 'Self employed', 'Living together', 'No'),
 (1, 'Kenya', 2018, 'No', 'Rural', 'No', 5, 70, 'Female', 'Head of Household', 'Widowed', 'No formal education', 'Government Dependent', 'Widowed', 'Yes'),
 (2, 'Kenya', 2018, 'Yes', 'Urban', 'Yes', 5, 26, 'Male', 'Other relative', 'Single', 'Vocational/Specialised training', 'Self employed', 'Never Married', 'No'),
 (3, 'Kenya', 2018, 'No', 'Rural', 'Yes', 5, 34, 'Female', 'Head of Household', 'Married', 'Primary education', 'Formally employed Private', 'Living together', 'Yes'),
 (4, 'Kenya', 2018, 'No', 'Urban', 'No', 8, 26, 'Male', 'Child', 'Single', 'Primary education', 'Informally employed', 'Never Married', 'No')]

#SQL Analysis

## 1.To determine the number of people with access to bank accounts and how this varies in urban and rural areas, between the job type

In [ ]:
# To determine the number of people with access to bank accounts and how this varies in urban and rural areas
%%sql
select count(bank_account), location_type
from Financial
where bank_account = 'Yes'
group by location_type

 * sqlite://
Done.

[(1671, 'Rural'), (1641, 'Urban')]

In [ ]:
# To determine the number of people with access to bank accounts and how this varies with job type
%%sql
select count(bank_account), job_type
from Financial
where bank_account = 'Yes'
group by job_type
order by count(bank_account) desc

 * sqlite://
Done.

[(848, 'Self employed'),
 (635, 'Farming and Fishing'),
 (571, 'Formally employed Private'),
 (445, 'Informally employed'),
 (300, 'Formally employed Government'),
 (240, 'Remittance Dependent'),
 (196, 'Other Income'),
 (50, 'Government Dependent'),
 (14, 'Dont Know/Refuse to answer'),
 (13, 'No Income')]

## 2.To determine the country with the most mobile phones and the highest number of bank accounts.

In [ ]:
# 2.01 To determine the country with the most bank accounts
%%sql
select country, count(bank_account)
from Financial
where bank_account = 'Yes'
group by country
order by count(bank_account) desc 
limit(1)

 * sqlite://
Done.

[('Kenya', 1521)]

In [ ]:
# 2.02 To determine the country with the most mobile phones.
%%sql
select country, count(cellphone_access)
from Financial
where cellphone_access = 'Yes'
group by country
order by count(cellphone_access) desc
limit(1)

 * sqlite://
Done.

[('Rwanda', 7249)]

## 3.To determine the people to be targeted with mobile banking intergration

In [ ]:
%%sql
select count(bank_account), count(cellphone_access), job_type
from Financial
where bank_account = 'Yes' and cellphone_access = 'Yes'
group by job_type
order by count(bank_account) desc

 * sqlite://
Done.

[(831, 831, 'Self employed'),
 (605, 605, 'Farming and Fishing'),
 (568, 568, 'Formally employed Private'),
 (435, 435, 'Informally employed'),
 (296, 296, 'Formally employed Government'),
 (227, 227, 'Remittance Dependent'),
 (186, 186, 'Other Income'),
 (35, 35, 'Government Dependent'),
 (14, 14, 'Dont Know/Refuse to answer'),
 (11, 11, 'No Income')]

## 4.To determine the job type to be targeted with fintech marketing in the region for people with a phone but no bank account

In [ ]:
%%sql
select count(bank_account), count(cellphone_access), job_type
from Financial
where bank_account = 'No' and cellphone_access = 'Yes'
group by job_type
order by count(bank_account) desc

 * sqlite://
Done.

[(3918, 3918, 'Farming and Fishing'),
 (3688, 3688, 'Self employed'),
 (3681, 3681, 'Informally employed'),
 (1383, 1383, 'Remittance Dependent'),
 (601, 601, 'Other Income'),
 (440, 440, 'Formally employed Private'),
 (282, 282, 'No Income'),
 (87, 87, 'Government Dependent'),
 (85, 85, 'Formally employed Government'),
 (81, 81, 'Dont Know/Refuse to answer')]

## 5.To determine the influence of mobile phone access and location to job type

In [ ]:
%%sql
select job_type, location_type,cellphone_access, count(cellphone_access)
from Financial
group by job_type
order by count(cellphone_access) desc

 * sqlite://
Done.

[('Self employed', 'Urban', 'Yes', 6437),
 ('Informally employed', 'Urban', 'Yes', 5597),
 ('Farming and Fishing', 'Rural', 'Yes', 5441),
 ('Remittance Dependent', 'Urban', 'No', 2527),
 ('Other Income', 'Rural', 'Yes', 1080),
 ('Formally employed Private', 'Urban', 'Yes', 1055),
 ('No Income', 'Rural', 'Yes', 627),
 ('Formally employed Government', 'Rural', 'Yes', 387),
 ('Government Dependent', 'Urban', 'No', 247),
 ('Dont Know/Refuse to answer', 'Rural', 'No', 126)]

## 6.To determine which age has the most access to mobile phones, mobile phones and no bank account, mobile phones and bank accounts

In [ ]:
#Respondent age with most access to mobile phones
%%sql
select age_of_respondent, count(cellphone_access)
from Financial
where cellphone_access = 'Yes'
group by age_of_respondent
order by count(cellphone_access) desc
limit 1

 * sqlite://
Done.

[(30, 824)]

In [ ]:
#Respondent age with most access to mobile phones without bank account
%%sql
select age_of_respondent, count(cellphone_access)
from Financial
where cellphone_access = 'Yes' and bank_account = 'No'
group by age_of_respondent
order by count(cellphone_access) desc
limit 1

 * sqlite://
Done.

[(30, 648)]

In [ ]:
#Respondent age with highest cell phone access and access to bank accounts
%%sql
select age_of_respondent, count(cellphone_access)
from Financial
where cellphone_access = 'Yes' and bank_account = 'Yes'
group by age_of_respondent
order by count(cellphone_access) desc
limit 1

 * sqlite://
Done.

[(30, 176)]

In [ ]:
%%sql
select age_of_respondent, count(bank_account)
from Financial
where bank_account = 'Yes'
group by age_of_respondent
order by count(bank_account) desc
limit 1

 * sqlite://
Done.

[(30, 177)]

## 7.To determine the percentage of level of access to mobile phones for people in the region per country and percentage of level of access in region

In [ ]:
#Percentage of level of access per country
%%sql
select country,count(cellphone_access), (100*count(cellphone_access)/(select count(cellphone_access) from Financial where cellphone_access = 'Yes')) as percentage_country
from Financial
where cellphone_access = 'Yes' 
group by country
order by count(cellphone_access) desc

 * sqlite://
Done.

[('Rwanda', 7249, 41),
 ('Kenya', 4785, 27),
 ('Tanzania', 3956, 22),
 ('Uganda', 1464, 8)]

In [ ]:
#Percentage of cell phone access in region
%%sql
select (select count(cellphone_access) from Financial where cellphone_access = 'Yes')
 as Regional_cell_count, (select count(cellphone_access) from Financial) as Region_total,
(100*(select count(cellphone_access) 
from Financial where cellphone_access = 'Yes')/ (select count(cellphone_access) from Financial))
 as percentage_region

 * sqlite://
Done.

[(17454, 23524, 74)]

## 8.To determine the level of access to mobile phones for people in urban areas and rural areas

In [ ]:
# To determine the number of people with access to cell phones in urban and rural areas
%%sql
select count(cellphone_access), location_type
from Financial
group by location_type

 * sqlite://
Done.

[(14343, 'Rural'), (9181, 'Urban')]

##9. To determine the influence of education level to cell phone access and bank account access

In [ ]:
%%sql
select education_level,cellphone_access, count(cellphone_access)
from Financial
group by education_level,cellphone_access
order by count(cellphone_access) desc

 * sqlite://
Done.

[('Primary education', 'Yes', 9441),
 ('Secondary education', 'Yes', 3608),
 ('Primary education', 'No', 3350),
 ('No formal education', 'Yes', 2520),
 ('No formal education', 'No', 1995),
 ('Tertiary education', 'Yes', 1081),
 ('Vocational/Specialised training', 'Yes', 781),
 ('Secondary education', 'No', 615),
 ('Tertiary education', 'No', 76),
 ('Other/Dont know/RTA', 'Yes', 23),
 ('Vocational/Specialised training', 'No', 22),
 ('Other/Dont know/RTA', 'No', 12)]

In [ ]:
%%sql
select education_level,bank_account, count(bank_account)
from Financial
group by education_level,bank_account
order by count(bank_account) desc

 * sqlite://
Done.

[('Primary education', 'No', 11698),
 ('No formal education', 'No', 4339),
 ('Secondary education', 'No', 3240),
 ('Primary education', 'Yes', 1093),
 ('Secondary education', 'Yes', 983),
 ('Tertiary education', 'Yes', 591),
 ('Tertiary education', 'No', 566),
 ('Vocational/Specialised training', 'Yes', 458),
 ('Vocational/Specialised training', 'No', 345),
 ('No formal education', 'Yes', 176),
 ('Other/Dont know/RTA', 'No', 24),
 ('Other/Dont know/RTA', 'Yes', 11)]

##10.To determine influence of marital status to bank account access and cellphone access

In [ ]:
%%sql
select marital_status ,cellphone_access, count(cellphone_access)
from Financial
group by marital_status,cellphone_access
order by count(cellphone_access) desc

 * sqlite://
Done.

[('Married', 'Yes', 8787),
 ('Single', 'Yes', 5603),
 ('Single', 'No', 2380),
 ('Married', 'No', 1962),
 ('Widowed', 'Yes', 1601),
 ('Divorced', 'Yes', 1456),
 ('Widowed', 'No', 1107),
 ('Divorced', 'No', 620),
 ('Dont know', 'Yes', 7),
 ('Dont know', 'No', 1)]

In [ ]:
%%sql
select marital_status,bank_account, count(bank_account)
from Financial
group by marital_status,bank_account
order by count(marital_status) desc

 * sqlite://
Done.

[('Married', 'No', 8883),
 ('Single', 'No', 7017),
 ('Widowed', 'No', 2464),
 ('Married', 'Yes', 1866),
 ('Divorced', 'No', 1842),
 ('Single', 'Yes', 966),
 ('Widowed', 'Yes', 244),
 ('Divorced', 'Yes', 234),
 ('Dont know', 'No', 6),
 ('Dont know', 'Yes', 2)]

##11. To determine influence household size to cell phone access and bank account access

In [ ]:
%%sql
select household_size,cellphone_access, count(cellphone_access)
from Financial
group by household_size,cellphone_access
order by count(cellphone_access) desc

 * sqlite://
Done.

[(2, 'Yes', 3441),
 (3, 'Yes', 2937),
 (4, 'Yes', 2774),
 (5, 'Yes', 2307),
 (1, 'Yes', 2082),
 (2, 'No', 1788),
 (6, 'Yes', 1668),
 (7, 'Yes', 1098),
 (3, 'No', 983),
 (1, 'No', 975),
 (4, 'No', 700),
 (8, 'Yes', 593),
 (5, 'No', 546),
 (6, 'No', 428),
 (7, 'No', 302),
 (9, 'Yes', 283),
 (8, 'No', 158),
 (10, 'Yes', 144),
 (9, 'No', 80),
 (11, 'Yes', 51),
 (10, 'No', 46),
 (12, 'Yes', 40),
 (12, 'No', 28),
 (11, 'No', 18),
 (13, 'Yes', 18),
 (15, 'Yes', 9),
 (13, 'No', 7),
 (14, 'No', 5),
 (14, 'Yes', 5),
 (16, 'Yes', 3),
 (15, 'No', 2),
 (16, 'No', 1),
 (17, 'Yes', 1),
 (18, 'No', 1),
 (20, 'No', 1),
 (21, 'No', 1)]

In [ ]:
%%sql
select household_size,bank_account, count(bank_account)
from Financial
group by household_size,bank_account
order by count(bank_account) desc

 * sqlite://
Done.

[(2, 'No', 4610),
 (3, 'No', 3361),
 (4, 'No', 2973),
 (1, 'No', 2473),
 (5, 'No', 2426),
 (6, 'No', 1819),
 (7, 'No', 1223),
 (8, 'No', 665),
 (2, 'Yes', 619),
 (1, 'Yes', 584),
 (3, 'Yes', 559),
 (4, 'Yes', 501),
 (5, 'Yes', 427),
 (9, 'No', 326),
 (6, 'Yes', 277),
 (7, 'Yes', 177),
 (10, 'No', 165),
 (8, 'Yes', 86),
 (11, 'No', 63),
 (12, 'No', 61),
 (9, 'Yes', 37),
 (10, 'Yes', 25),
 (13, 'No', 23),
 (15, 'No', 9),
 (14, 'No', 8),
 (12, 'Yes', 7),
 (11, 'Yes', 6),
 (16, 'No', 4),
 (13, 'Yes', 2),
 (14, 'Yes', 2),
 (15, 'Yes', 2),
 (17, 'Yes', 1),
 (18, 'No', 1),
 (20, 'No', 1),
 (21, 'No', 1)]